### This is new interface of images


import torch
from torchvision import datasets, models, transforms
import torch.nn as nn
# System
import os
import time
from datetime import timedelta
import datetime
from io import BytesIO
# Tools
import argparse
import numpy as np
from PIL import Image
from PIL import ImageFile
import pandas as pd
import glob
ImageFile.LOAD_TRUNCATED_IMAGES = True # force read image file for trunctucated images
import timm # pip install timm, a opensource model structure library
from flask import make_response
from flask import Flask, render_template, request, redirect, url_for, make_response,jsonify
def GetClassNames(mode):
    """
    get labels of all classes
    for difference situation
    """
    if mode == "debug":
        # path_dict=pd.read_csv("test_food1340.csv")
        # path_dict=path_dict.name.tolist()
        # names=path_dict
        names=[]
        folders = glob.glob("/root/dataset/refresh1000/*")
        for folder in folders:
            name = os.path.basename(folder)
            names.append(name)
    if mode == "hardcode":
        # names=['苦瓜炒蛋', '芹菜肉丝', '南瓜粥', '木须肉', '蒜薹炒肉', '鹌鹑蛋烧肉', '红烧猪蹄', '宫保鸡丁', '糖醋里脊', '蒜香生菜', '地瓜糯米饼', '炒红苋菜', '硬皮糕点', '菠萝咕老豆腐', '炒莴苣叶', '芋头红烧肉', '紫菜蛋饺汤', '清淡丝瓜汤', '鳕鱼排', '焖鸡中翅', '奶油小西点', '西兰花番茄鸡蛋汤', '玉米胡萝卜排骨汤', '清炒黄瓜', '肉末豆腐', '鸡蛋饼', '银耳汤', '平菇肉片汤', '肉末豌豆', '清炒大白菜', '火腿蔬菜粥', '冬瓜排骨汤', '皮蛋冬瓜汤', '青椒炒肉', '酱黄瓜', '土豆芝士虾球', '蘑菇炒肉', '土豆牛腩', '煎薯条', '玉米胡萝卜汤', '炒空心菜', '肉末蒸蛋', '萝卜清汤', '卤鸡腿', '莴苣肉片', '家常肉末豆腐', '豆芽炒韭菜', '清炒丝瓜', '蚂蚁上树', '炒苕尖', '花卷', '白切鸡', '面包', '洋葱炒蛋', '蒜蓉空心菜', '肉丝烧茄子', '青菜肉片汤', '红烧丸子', '酥炸鱼排', '豆豉蒸排骨', '紫菜鸡蛋汤', '可可杏仁饼干', '可乐酱油鸡爪', '可乐鸡腿', '醋溜土豆丝', '擀面条', '腐竹烧肉', '萝卜泡菜', '煮饺子', '丝瓜蛋汤', '鲜蔬芙蓉汤', '瘦肉山药炒木耳', '虾仁豆腐汤', '蒜香油麦菜', '咖喱土豆牛肉焗饭', '清炒白菜', '豆角炖肉', '板栗烧肉', '红豆粥', '胡萝卜烧鸭', '鱼香茄子', '西红柿蛋汤', '雪菜土豆汤', '火腿炒蛋', '冬瓜肉片汤', '葱油拌刀削面', '鲜肉包', '台式卤肉饭', '清炒鸡毛菜', '肉丝炒白萝卜', '清炒娃娃菜', '丝瓜肉丸汤', '奶香小馒头', '土豆烧肉', '杏仁紫薯糕', '炒三丁', '香源 豆沙包', '炒南瓜', '鱼香肉丝', '咖喱鸡块', '热干面', '馄饨', '煎焗沙尖鱼', '韭菜炒鸡蛋', '糍粑鱼', '清炒花菜', '土豆炖牛腩', '胡萝卜木耳肉片', '虾米菠菜鸡蛋汤', '丝瓜炒蛋', '香干炒肉丝', '菠菜粉丝汤', '绿豆粥', '番茄鸡蛋疙瘩汤', '清炒江城菜心', '清炒豆芽', '豆浆', '玛格丽特饼干', '菠菜包', '番茄蛋花汤', 'Bibigo 海带汤', '土豆炖排骨', '排骨汤', '咖喱土豆炖鸡腿', '馒头', '黄瓜炒火腿肠', '肉末茄子', '水饺', '醋溜白菜', '葱油鲍鱼', '葱花花卷', '肉末粉丝', '番茄鸡蛋汤', '烧花蛤', '玉米炒火腿', '葱油花卷', '虎皮青椒', '煮麻辣牛肉', '番茄疙瘩汤', '杏鲍菇炒肉', '菠菜丸子汤', '醋溜大白菜', '红烧肉炖豆角', '手撕包菜', '玉米糊糊粥', '珍珠丸子', '皮蛋黄瓜汤', '水煮油麦菜', '胡萝卜黑木耳炒肉', '猪肉炖粉条', '烤茄子', '豆干素炒', '青椒肉丝', '萝卜丝饼', '青菜粥', '菠萝咕噜肉', '水煮肉片', '水煮鸡蛋', '莲子养生汤', '西红柿炒鸡蛋', '萝卜丝肉丸汤', '可乐排骨', '香菇炖鸡', '素炒花菜', '粉蒸排骨', '萝卜丝肉丸', '银耳绿豆汤', '虾仁炒西兰花', '红枣银耳汤', '冬瓜虾皮汤', '鸡米花', '韭黄炒蛋', '蒜蓉娃娃菜', '小米粥', '可可杂粮饼', '清炒土豆丝', '红烧豆腐', '菠萝炒饭', '莴笋胡萝卜肉片', '蒜蓉西兰花', '肉炒蒜苔', '菠萝古老肉', '豆腐青菜汤', '营养炒饭', '清炒小白菜', '粳米粥', '烤鲳鱼', '耗油生菜', '燕麦粥', '菌菇汤', '雪梨蒸冰糖', '玉米浓汤', '冬瓜虾米汤', '萝卜排骨汤', '虾仁青豆玉米', '清炒苋菜', '焖面', '萝卜烧牛腩', '红烧鸡翅', '肉末粉丝汤', '茄子豆角', '茶叶蛋', '粉蒸肉', '酱香热干面', '西蓝花炒鸡胸', '土豆焖肉', '可乐鸡翅', '荷包蛋焖面', '木耳枣鸡汤', '兴旺 雪菜', '千张炒肉丝', '清蒸南瓜', '糖炒栗子', '红烧鱼块', '清炒西兰花', '冬瓜炖牛肉', '牛奶煮麦片', '回锅肉', '西兰花肉片', '八记 红枣枸杞鸡汤', '香菇焖鸭', '烤虾', '红烧狮子头', '典发 千叶豆腐', '番茄龙利鱼', '土豆鲜肉饼', '黑米粥', '红烧排骨', '鸡蛋肉丝面条', '山药汤', '红豆汤', 'Fair Price 白馒头', '鸭血粉丝汤', '红薯粥', '绮罗园 苦荞粥', '榨菜', '凉拌海带丝', '猪骨红萝卜汤', '时蔬鸡蛋肉丝面', '银耳枸杞汤', '肉末毛豆', '酱豆腐（腐乳）', '芝麻糊', '果记 圣女果', '洋葱炒肉', '蚝油生菜', '豆腐肉丝汤', '滑蛋虾仁', '土豆烧鸡', '粉丝肉末汤', '青菜粉丝肉丸汤', '琥珀核桃', '山药羊肉汤', '红烧鸡腿', '西红柿炒菜花', '清炒南瓜', '清蒸龙利鱼柳', '牛肉萝卜汤', '豆奶', '葱油蚕豆', '香干回锅肉', '小馄饨', '葱爆牛肉', '清炒上海青', '清炒茼蒿菜', '南瓜汤', '烧腐竹', '苹果', '菌菇鱼片汤', '肉片烧菜花', '鹌鹑蛋红烧肉', '传统三鲜汤', '清炒黄豆芽', '紫菜蛋花汤', '烤香菇', '小笼包', '口味小龙虾', '葱香花卷', '西红柿炒蛋', '丝瓜肉丸子汤', '酸菜粉丝汤', '西芹肉丝', '清炒莴笋', '黑米馒头', '番茄炒蛋', '黄焖鸡', '青椒胡萝卜炒山药', '番茄豆皮汤', '芹菜炒肉', '豆花', '家常红烧糖醋排骨', '鱼丸汤', '绿豆汤', '梅林 梅干菜包', '梅干菜扣肉', '番茄豆芽汤', '佳诚 水果羹', '珍珠圆子', '干锅花菜', '砂锅杂粮粥']
        names=['菠菜鱼丸汤', '尖椒炒木耳', '粉丝茄子煲', '蒜香西兰花炒虾球', '胡萝卜炒圆白菜丝', '冬瓜香菇海带汤', '脆皮豆腐', '西兰花炒黑木耳', '香椿炒鸡蛋', '口蘑焖豆腐', '白菜心拌海蜇皮', '杏仁菠菜', '木耳莴笋肉丝', '肉末毛豆', '玉米胡萝卜汤', '土豆浓汤', '什锦汤面条', '茶叶蛋', '海米炖冻豆腐', '有机蒜蓉西兰花', '南瓜粥', '青椒豆腐炒肉片', '清炒豆芽', '蚝油生菜', '胡萝卜黑木耳炒肉', '香煎茄子', '三鲜日本豆腐', '炒咸菜', '爽口木耳', '银耳绿豆汤', '油焖茄子', '鲜鱿炒西兰花', '胡萝卜蒜苔炒肉丝', '西兰花拌黑木耳', '韭菜炒肉末', '三鲜粉丝汤', '水煮油麦菜', '海带豆腐汤', '蔬菜豆腐羹', '清炒山药', '清炒木耳菜', '小土豆红烧排骨', '香烤小排骨', '韭菜花炒鸡蛋', '肉片焖豆角', '麻婆牛肉豆腐', '白萝卜排骨汤', '苦瓜炒蛋', '蔬菜鲜高汤', '素炒红豆角', '凉拌胡萝卜丝', '木耳炒洋葱', '萝卜丝丸子汤', '木耳炒鸡', '土豆酿茄子', '秋葵炒肉丝', '五花肉焖腐竹', '素炒黄花菜', '排骨烧土豆', '海带冬瓜汤', '番茄洋葱牛肉汤', '炒番茄', '冬瓜汤', '酸豆角炒鸡蛋', '清炒丝瓜', '培根生菜卷', '炝炒白菜', '虾仁木耳娃娃菜', '牛肉萝卜汤', '蒜薹炒肉丝', '杏鲍菇烧茄子', '肉丝炒有机花菜', '芹菜炒肉', '酱香排骨', '黄瓜凉拌黑木耳', '清蒸排骨', '西兰花烧豆腐', '香煎千页豆腐', '红烧狮子头', '什锦冻豆腐汤', '虾仁青豆玉米', '番茄炒花菜', '香源 豆沙包', '土豆牛腩', '双椒牛肉丁', '木耳香炒蛋', '西兰花煎蛋', '杏鲍菇小炒肉', '蒸米饭', '杂粮米饭', '千张炒肉丝', '毛豆炒肉丝', '蘑菇炒菜心', '凉拌菠菜粉丝', '杏仁豆腐', '凉拌木耳', '香菇红烧排骨', '虾仁白菜馄饨', '白菜豆腐粉丝煲', '鸡蛋豆腐卷', '玉米莲藕炖排骨', '羊肉汤', '杏鲍菇烩豆腐', '五香卤藕片', '花蛤豆腐汤', '酱香豆腐', '蔬菜云吞汤', '家常肉末豆腐', '芦蒿炒肉丝', '干锅有机花菜炒肉片', '酱香茄子', '豉汁排骨', '菠菜炒鸡蛋', '青菜粉丝肉丸汤', '黄瓜炒黑木耳', '鱼丸汤', '蒜蓉空心菜', '冬瓜排骨煲', '上汤海参', '白玉菇炒青菜', '豆豉干煸有机花菜', '香菇木耳烩', '彩椒炒木耳', '黄瓜丝拌豆腐丝', '冬瓜排骨汤', '菠菜包', '山药玉米排骨汤', '拌白菜心', '番茄姜汁脆皮虾', '冬瓜玉米排骨汤', '酱烧茄子', '春笋炒肉丝', '蚝油香菇青菜', '香菇炖鸡', '大葱炒肉', '黑木耳炒丝瓜', '木耳拌西兰花', '排骨莲藕汤', '青椒小炒肉', '青红椒炒肉', '全麦馒头', '豆角炖肉', '猪肝汤', '豌豆炒肉', '清炒黄豆芽', '洋葱杏鲍菇炒肉片', '辣白菜炒年糕', '青菜肉片汤', '木耳炒青红辣椒丝', '木耳山药炖排骨', '滑炒鸡丝', '牛奶鸡蛋羹', '爆炒圆白菜', '红烧猪蹄', '黄瓜青椒炒木耳', '燕麦粥', '玉子豆腐', '番茄洋葱炒蛋', '茭白炒肉丝', '洋葱炒木耳', '红豆银耳雪梨汤', '红烧排骨土豆', '豆腐拌蛋黄', '水煮肉片', '麻酱凉拌空心菜', '三鲜鳝鱼汤', '灌汤包', '腐竹烧排骨', '黑米馒头', '上汤鲈鱼', '西兰花炒虾仁', '奶香小馒头', '黄花菜炒木耳', '鱼香菠菜', '雪菜土豆汤', '豆腐羹', '宫爆茄子', '葱爆牛肉', '芹菜豆干炒肉丝', '黄瓜口蘑炒肉片', '黑木耳炖冻豆腐', '酿豆腐', '面筋酿肉', '炒油麦菜', '上汤日本豆腐', '红烧肉炖豆角', '麻婆豆腐', '香椿拌豆腐皮', '菠菜炖豆腐', '菠菜肉丝面', '内酯豆腐丝汤', '香煎酿油豆腐', '白萝卜炖排骨', '清炒冬瓜', '莲子养生汤', '小白菜炒豆腐', '叉烧肉', '凉拌木耳菜', '青豆玉米炒火腿', '木耳炒荷兰豆', '清炒土豆丝', '冻豆腐汤', '菠菜鸡蛋面', '双椒炒牛肉', '卤汁排骨', '苦瓜炒肉片', '鸡蛋菠菜蛋盅', '蜜汁排骨', '土豆胡萝卜炖牛腩', '水笋炒肉丝', '鸡蛋青菜番茄面', '金针菇炒菠菜', '辣椒小炒肉', '番茄炖牛腩', '蟹汁蒸鲈鱼', '莴笋炒鸡蛋', '鸡蛋羹', '丝瓜酿豆腐', '鲜虾嫩豆腐', '洋葱牛肉', '茶树菇老鸭汤', '土豆烧鸡', '土豆豆角炖排骨', '红豆莲子汤', '黄瓜青椒炒肉', '白灼生菜', '蘑菇炖鸡汤', '黑木耳炒藕片', '芋头蒸排骨', '炒三丁', '有机花菜炒花肉', '海米油菜烩豆腐', '白灼菜心', '西红柿蛋花汤', '木耳白菜肉丝汤', '蒜薹木耳炒肉丝', '五花肉白菜炖豆腐', '虾仁日本豆腐', '牛腩番茄汤', '传统汤圆', '圆白菜炒粉丝', '猪肉炖粉条', '红枣木耳汤', '丝瓜炒木耳', '番茄煨牛肉', '凉拌油豆腐金针菇', '冬笋汤', '木耳炒菠菜', '蚝油香菇菜心', '豆角烧茄子', '清炒白菜', '豆豉蒸排骨', '平菇蛋汤', '彩椒炒牛肉', '鱼香肉末豆腐', '辣白菜炒五花肉', '冻豆腐大白菜', '牛肉粉丝汤', '绮罗园 苦荞粥', '酥炸鱼排', '番茄菌菇锅', '鸡汤面', '洋葱芦笋炒鸡蛋', '凉拌番茄', '蒸馒头', '白菜面筋', '上汤菠菜鸡蛋面', '蔬菜莲藕汤', '银耳百合汤', '水饺', '西蓝花炒鸡胸', '芹菜炒木耳', '酱豆腐（腐乳）', '百合炒西兰花', '西兰花炒木耳', '鸡汁豆腐串', '番茄菜花', '圆白菜炒肉片', '椰菜花炒木耳', '红豆粥', '干锅花菜', '虾仁炒西兰花', '三鲜水饺', '虾仁豆腐汤', '秋葵木耳炒鸡蛋', '硬皮糕点', '鸭血粉丝汤', '蘑菇炖豆腐', '培根洋葱土豆汤', '素炒山药', '丝瓜鱼丸汤', '虾仁豆腐', '三杯鸡', '凉拌豆腐', '木耳炝拌土豆片', '清汤挂面', '炒胡萝卜土豆丝', '冬瓜海带花蛤汤', '素水饺', '煮饺子', '热汤面', '滑蛋番茄牛肉', '杏鲍菇炒木耳', '鲜笋口蘑炒肉片', '红烧丸子', '椒盐排骨', '凉拌内酯豆腐', '粉蒸排骨土豆', '春笋焖排骨', '小米青菜粥', '西葫芦炒肉片', '红薯粥', '丝瓜炒肉片', '鱼香豆腐', '清炒山药木耳', '葱油蚕豆', '蜇皮拌白菜', '蕨菜炒肉', '豆腐烧菠菜', '清汤牛肉面', '冻豆腐粉条金针菇', '黑木耳拌苦瓜', '茄子炒蛋', '空心菜叶炒鸡蛋', '蔬菜蛋羹', '冬瓜蛤蜊汤', '浓汤娃娃菜', '芹菜木耳炒鸡蛋', '红烧带鱼', '红枣银耳汤', '油豆腐烧茄子', '冬笋烧排骨', '山药炒黑木耳', '木耳烩鱼片', '兴旺 雪菜', '鸡蛋木耳炒莴笋', '排骨豆角焖面', '小米椒小炒肉', '黑木耳虾仁炒青菜', '蒜蓉蒸茄子', '清炒鸡毛菜', '爆炒小白菜', '白玉豆腐', '鸡蛋生菜卷饼', '煎水饺', '萝卜清汤', '油麦菜炖豆腐', '蔬菜丸子汤', '番茄牛肉汤', '豆花', '玉米糊糊粥', '麻将杏仁豆腐', '蒜香油麦菜', '冬瓜海带汤', '番茄萝卜炖牛腩', 
        '洋葱木耳炒蛋', '紫菜鸡蛋汤', '排骨炖豆角土豆', '冬瓜丸子粉丝汤', '火腿炒蛋', '酸菜排骨汤', '山药排骨汤', '糯米蒸排骨', '皮蛋黄瓜汤', '青椒榨菜炒肉丝', '小葱煎豆腐', '冬瓜炖牛肉', '清拌白菜心', '清炒茼蒿菜', '清炒西葫芦', '番茄虾', '番茄虾仁汤', '排骨玉米莲藕汤', '尖椒炒茄子', '番茄土豆烩牛肉', '素丸子汤', '山药炒肉片', '脆皮茄子', '黄刺鱼炖豆腐', '口蘑扒菜心', '粉丝肉末汤', '双椒腐竹炒木耳', '炒有机花菜', '肉末豆腐', '牛奶煮麦片', '豆奶', '木耳菠菜鸡蛋汤', '炒大白菜', '腊肠炒胡萝卜', '木耳拌菠菜', '凉拌山药', '洋葱杂菜汤', '西芹木耳炒鸡蛋', '菠菜蒸蛋', '黄瓜拌木耳', '鸡蛋菠菜拌粉丝', '猪肉白菜炖粉条', '豆芽炒韭菜', '蒜蓉蒸金针菇', '黄瓜拌豆腐丝', '凉拌小青菜', '木耳炒西芹', '肉末茄子', '木耳炒牛肉', '面包', '田园杂蔬汤', '木耳炒鸡肉', '五花肉炒白菜', '糖醋排骨', '传统三鲜汤', '虾仁青菜蛋炒饭', '土豆片炒肉', '五花卤肉饭', '鸡米花', '早餐胡萝卜饼', '老醋菠菜', '肉丝绿豆芽汤', '胡萝卜烧鸭', '西兰花番茄鸡蛋汤', '番茄里脊', '洋葱牛肉馅饼', '莴苣木耳拌鸡丝', '香菇青菜面', '海带炖冻豆腐', '菠菜疙瘩汤', '西红柿蛋汤', '胡萝卜炒肉片', '黄鱼豆腐羹', '麻酱拌白菜', '凉拌茄子', '丝瓜花蛤汤', '冬菇菜心炒面', '红烧排骨', '冻豆腐炖海带', '蔬菜牛肉汤', '酱鸭', '鲶鱼炖豆腐', '木耳西兰花', '菜花炒鸡蛋', '豆腐炒四季豆', '土豆番茄炖牛腩', '卷心菜洋葱汤', '鲜蘑炒肉', '羊肉萝卜汤', '青菜粥', '灌汤丸子', '冬瓜虾仁汤', '番茄烩煎豆腐', '茄汁锅塌豆腐', '小葱拌豆腐', '五花肉金针菇', '西芹肉丝', '麻汁豆腐', '土豆烧排骨', '拌白菜水萝卜丝', '铁板豆腐', '番茄豆皮汤', '拌皮蛋豆腐', '青椒肉丝', '南瓜蒸排骨', '什锦嫩豆腐', '虾仁番茄鸡蛋汤', '凉拌嫩豆腐', '酱烧豆腐', '芦笋炒肉丝', '彩椒爆炒牛肉丝', '炒鸡蛋', '木耳拌黄瓜', '三味白切鸡', '番茄菜花炒肉片', '平菇炒牛肉', '香菇肉丸汤', '白玉菇烧豆腐', '尖椒小炒肉', '芹菜小炒肉', '上汤云吞', '素炒三丝', '干煸牛肉末扁豆', '五花肉炖白菜', '海鲜冬瓜汤', '冬瓜虾米汤', '清炖鸡汤', '素炒空心菜', '冰镇绿豆汤', '小笼包', '青笋炒肉片', '小黄鱼烩豆腐', '酸豆角炒豆腐', '牛肉丸子汤', '木耳鱼片', '杂蔬疙瘩汤', '卤五香豆腐干', '醋熘白菜', '豆干炒肉丝', '小炒西兰花', '蒜蓉娃娃菜', '圆白菜炒青椒', '玉米时蔬排骨汤', '腌笃鲜汤', '冬瓜虾皮汤', '咖喱鸡块', '蛋黄虾仁豆腐', '小葱炒鸡蛋', '肉末豌豆', '凉拌海白菜', '油豆腐酿肉', '杭椒炒鸡蛋', '平菇鱼丸汤', '土豆牛肉胡萝卜', '炒菜心', '白菜豆腐泡', '肉末粉丝', '糍粑鱼', '酱香烧茄子', '木耳蒜苗炒鸡蛋', '肉末蒸蛋', '杏仁拌豆腐', '韭菜炒鸡蛋', '洋葱青椒炒鸡丁', '孜然千叶豆腐', '排骨冬瓜汤', '胡萝卜烧羊肉', '蒜蓉豆豉蒸排骨', '彩椒炒大白菜梗', '烧块鸭', '虾仁小白菜疙瘩汤', '蒜香生菜', '芹菜肉丝', '冬菇瘦肉木耳汤', '酱黄瓜', '韩国辣白菜', '豆角炒肉丝', '葱油花菜', '木耳汤', '糖醋鲈鱼', '番茄胡萝卜炖牛肉', '昂公鱼炖豆腐', '豆腐肉丝汤', '春笋豆腐汤', '凉拌酱牛肉', '葱花花卷', '花生酱拌菠菜', '青菜鸡蛋面', '番茄鸡肉球', '冬瓜牛肉丸子汤', '黄焖鸡', '清炒山药片', '拌干豆腐丝', '豆干素炒', '香菇焖鸭', '杏鲍菇炒大白菜', '杂蔬排骨汤', '洋葱青椒炒肉', '木耳炒西兰花', '排骨焖面', '荷包蛋焖面', '清蒸南瓜', '笋烧豆腐', '豆腐炖鲫鱼', '胡萝卜炒肉', '冬瓜鸭汤', '土豆片炒五花肉', '家常三鲜汤', '丝瓜肉末汤', '丝瓜肉丸汤', '香卤豆腐干', '肉末豆角茄子', '宫保鸡丁', '酸辣豆腐', '蒜蓉菜心', '蒜苔炒鸡胸肉', '拌白菜海带丝', '口蘑蒜苔炒肉', '蒜蓉西兰花', '炒花菜', '番茄鸡蛋汤', '鸡蛋肉丝面条', '鲜笋炒牛肉', '花菜炒蛋', '海鲜酸辣汤', '韭黄炒鸡蛋', '胡萝卜木耳肉片', '八珍豆腐煲', '茄汁酿豆腐', '麻酱拌茄子', '木耳莴笋拌鸡丝', '荷兰豆炒肉', '娃娃菜黑木耳炒肉片', '干贝排骨汤', '豆腐干拌白菜心', '凉拌豆腐丝', '海带丝拌白菜', '鸡胸肉炒豆腐', '小包子', '绿豆粥', '白菜煮金针菇', '山药百合银耳羹', '糖醋脆皮豆腐', '菠菜汤', '疙瘩汤', '番茄牛肉面', '芦笋炒鸡蛋', '青椒肉沫豆腐', '五花肉炖土豆', '卤鸡腿', '银耳莲子汤', '牛肉炖胡萝卜', '茄子炒长豆角', '胡萝卜丝拌千张丝', '排骨菌菇煲', '番茄炒蚕豆', '玉米萝卜炖排骨', '青椒木耳炒肉丝', '馄饨', '青菜素包', '排骨茄子焖面', '日本豆腐肉末', '火腿西兰花', '豆腐蒸蛋', '回锅肉', '红豆汤', '西施豆腐', '胡萝卜糯米珍珠丸子', '白萝卜粉丝汤', '粳米粥', '双菇炒肉丝', '虾仁豆腐饼', '口蘑菜心', '番茄炒鸡蛋', '烤土豆豆腐片', '清香牛肉面', '香煎海鲈鱼', '炒茄子', '青菜炒肉', '白切鸡', '茄子炒肉末', '平菇炒肉', '葱香烤排骨', '什锦疙瘩汤', '杏鲍菇炒西兰花', '菠菜蛋饼', '糖醋白菜', '凉拌牛肉', '胡萝卜炖牛腩', '笋烧排骨', '清炖羊排萝卜汤', '娃娃菜豆腐汤', '鲜肉包', '炒红苋菜', '鱼香茄子', '清炒南瓜', '山药木耳排骨汤', '小白菜炒木耳', '番茄龙利鱼', '时蔬鸡蛋肉丝面', '酸豇豆炒肉末', '杏鲍菇炒肉丝', '菠菜炖鱼', '红烧鸡腿', '土豆玉米培根浓汤', '香菇烧排骨', '冬瓜丸子汤', '番茄烩花蛤', '红烧鲤鱼', '蚝油香蒜排骨', '毛豆炒鸡蛋', '虾米豆腐羹', '蔬菜鸡汤', '菌菇汤', '清炖羊肉汤', '泡椒黑木耳', '丝瓜肉片汤', '干锅牛肉包菜', '香菇丸子汤', '土豆牛肉汤', '番茄汤', '豆腐干炒肉丝', '擀面条', '炒米饭', '什锦豆腐', '海鲜豆腐羹', '黄瓜丝拌白菜', '桂花山药糕', '炒莴苣叶', '白菜冻豆腐粉丝汤', '可乐鸡翅', '西红柿炒蛋', '木耳炒肉丝', '平菇肉片汤', '清炒小白菜', '胡萝卜素丸子', '大葱爆牛肉', '姜葱爆猪肝', '回锅豆腐', '蒜香茄子', '香椿豆腐卷', '干煸茄子', '银耳汤', '山药排骨饭', '青椒胡萝卜炒山药', '黄花菜烧排骨', '鸡蛋豆腐蒸肉末', '土豆番茄汤', '八宝鸭丁', '木耳鸡肉片', '云吞面', '香椿芽炒鸡蛋', '木耳炒香干', '木耳菠菜', '酸菜炒肉', '黄瓜炒鸡丁', '西红柿木耳炒蛋', '杭椒炒牛肉', '清炒莴笋', '黄瓜木耳肉片', '冬瓜汆牛肉丸', '清炒大白菜',
         '胡萝卜炒蒜苔', '菠菜粉丝汤', '上汤上海青', '南瓜杂蔬焖米饭', '蘑菇小炒肉', '香干小炒肉', '东坡肉', '麻辣菠菜拌粉丝', '茶树菇炒肉', '平菇冬瓜汤', '海米菠菜汤', '秋葵丝瓜蛋汤', '蚝油西兰花烩杏鲍菇', '砂锅杂粮粥', '胡萝卜牛肉丝', '素炒菠菜', '西葫芦炒鸡蛋', '高汤白菜豆腐', '豆腐炒肉丁', '酿茄子', '娃娃菜炒肉', '鱼香肉丝', '金银豆腐', '豆腐鱼汤', '苋菜炒鸡蛋', '百合银耳莲子汤', '排骨汤', '什锦排骨汤', '黄瓜炒牛肉', '蒜苔洋葱炒木耳', '蚂蚁上树', '原汁鸡汤面', '松鼠鲈鱼', '清炒苋菜', '洋葱炒肉', '双椒烩豆腐', '素炒白菜粉条', '南瓜汤', '韭黄炒蛋', '冬瓜小排汤', 'Bibigo 海带汤', '上汤娃娃菜', '土豆炖排骨', '黑木耳烧菜花', '干烧豆腐', '雪菜毛豆炒肉末', '辣白菜', '西红柿疙瘩汤', '番茄烩牛腩', '鲜虾云吞', '素炒花菜', '佳诚 水果羹', '五花鲜肉棕', '茄子豆角', '小米粥', '蚝油西兰花', '豆腐炒白菜', '香拌菠菜', '土豆豆角炒肉', '尖椒腐竹炒肉', '凉拌菜心', '肉丝烧茄子', '炒空心菜', '海带炖排骨', '土豆炖豆腐', '木耳炖豆腐', '香干炒肉丝', '五花肉炖豆角', '丝瓜蛋汤', '蟹黄豆腐羹', '洋葱黄瓜炒鸡蛋', '土豆烧茄子', '蒜苗炒肉', '木耳小炒肉', '卷心菜炒胡萝卜', '干烧茄子', '醋溜大白菜', '茄子酿肉', '小土豆炖排骨', '茭白炒肉', '冬瓜排骨炖冻豆腐', '洋葱炒蛋', '鸡腿菇炒肉片', '木耳炖冻豆腐', '紫菜海鲜汤', '清炒花菜', '蘑菇青菜', '凉拌木耳花生米', '尖椒豆腐皮', '白萝卜肉片汤', '丝瓜炒蛋', '珍珠圆子', '西兰花炒牛肉', '丝瓜肉丸子汤', '卤牛肉', '板栗烧菜心', '开洋青菜土豆汤', '煎酿茄子', '干豆角炖排骨', '黄花鱼炖豆腐', '鱿鱼炒圆白菜', '洋葱炒鸡蛋', '尖椒牛肉', '酸溜大白菜', '鹌鹑蛋红烧肉', '莴苣肉片', '肉丝汤面', '胡萝卜土豆丝', '豇豆角炒肉', '木耳胡萝卜炒鸡蛋', '干锅排骨', '四季豆炒鸡蛋', '蘑菇豆腐羹', '上汤菠菜', '白菜炖冻豆腐', '三鲜豆腐汤', '凉拌手撕牛肉', '芹菜炒鸡蛋虾仁', '葱油鸡', '土豆排骨煲', '粉蒸肉', '莴笋炒鸡蛋干', '土豆炖鸡', '热干面', '韭菜炒木耳', '莲藕排骨汤', '素烧茄子', '可乐排骨', '素炒西兰花', '木耳冬笋鱼片汤', '洋葱木耳炒肉丝', '酱香热干面', '排骨玉米汤', '蔬菜疙瘩汤', '空心菜梗炒肉丝', '丝瓜虾米蛋汤', '时蔬排骨汤', '虾仁鸡蛋炒花菜', '酸豆角炒肉末', '八记 红枣枸杞鸡汤', '冰糖银耳红枣汤', '娃娃菜炖冻豆腐', '菠菜炒虾仁', '红烧鸡翅根', '烤豆腐', '梅林 梅干菜包', '玉米笋炒肉', '清炒娃娃菜', '韭菜木耳炒肉丝', '大白菜猪肉水饺', '地三鲜', '凉拌圆白菜', '西兰花炒花菜', '小馄饨', '芹菜木耳炒肉', '玉米炒火腿', '胡萝卜早餐饼', '水煮鸡蛋', '鲶鱼炖茄子', '白菜炒干丝', '茭白青椒炒肉丝', '酱爆茄子', '胡萝卜鸡蛋饼', '小馒头', '上汤金针菇豆苗', '鹌鹑蛋烧肉', '杏鲍菇粉丝汤', '豆腐拌皮蛋', '番茄蛋炒饭', '木耳枣鸡汤', '榨菜', '水晶汤包', '菠菜拌面', '鸡蛋豆腐', '番茄花菜', '典发 千叶豆腐', '蒜蓉烤茄子', '木耳炒肉', '豆腐肉末酿香菇', '回锅牛肉', '豉香蒜蓉蒸排骨', '胡萝卜炒洋葱', '杏鲍菇炒肉', '豆腐蒸肉', '洋葱生菜拌木耳', '菠菜丸子汤', '番茄皮蛋汤', '香菇拌豆腐丝', '青椒虎皮豆腐', '木耳青菜肉丸汤', '鸡蛋饼', '红豆薏米汤', '胡萝卜木耳炒洋葱', '香干菠菜塔', '卤汁豆腐干', '冬笋牛肉丝', '拌白菜丝', '茄汁豆腐', '豆干菜心', '肉末粉丝汤', '炒苕尖', '小蘑菇炒肉', '胡萝卜牛腩汤', '莴笋胡萝卜肉片', '尖椒炒鸡蛋', '青椒炒鸡胸肉', '小黄鱼炖大白菜', '鲜蔬芙蓉汤', '山药排骨粥', '土豆炖牛腩', '番茄豆芽汤', '炒白菜', '黄瓜炒火腿肠', '番茄金针蛋花汤', '青菜拌粉丝', '海米油菜心', '排骨炖豆角', '紫菜虾皮鸡蛋汤', '小白菜炖豆腐', '日本豆腐蒸蛋', '姜汁拌菠菜', '宁波汤团', '西红柿炒菜花', '双菌炒肉片', '金针菇炒肉丝', '黑木耳炒西兰花', '芝麻糊', '菠菜拌粉丝', '粉丝拌菠菜', '肉沫豆腐', '韭黄炒肉丝', '虾仁鲜豆腐', '冻豆腐虾仁汤', '豆腐青菜汤', '冬瓜海米汤', '白菜豆腐煲', '酸菜排骨', '木耳娃娃菜', '蒜香空心菜', '菠菜凉面', '果记 圣女果', '菠菜厚蛋烧', '豆腐肉末蒸蛋', '凉拌菠菜', '大虾炖白菜', '土豆烧肉', '尖椒西兰花', '清炒菠菜', '土豆拌茄子', '丝瓜鸡蛋疙瘩汤', '素炒茄子', '木耳炒鸡蛋', '丸子津菜汤', '莴笋炒肉丝', '干锅豆腐鱼', '香芹炒肉', '番茄蛋汤', '番茄大虾', '猪肉白菜馅饼', '豆腐炒蛋', '红烧豆腐', '杂蔬骨头汤', '青椒炒肉丝', '回锅肉炒胡萝卜', '清炒西兰花', '玉米排骨汤', '炝炒有机花菜', '木耳胡萝卜炒蘑菇', '溜豆腐', '葱香花卷', '双菇木耳炒肉片', '凉拌黑木耳', '豆浆', '木耳烧豆腐', '茶树菇烧排骨', '肉丝炒白萝卜', '虎皮青椒', '大白菜炖冻豆腐', '凉拌蒸茄子', '清炒江城菜心', '菌菇鱼片汤', '芝麻酱拌菠菜', '虎皮茄子', '木须肉', '玉米浓汤', '土豆丝炒肉', '番茄鸡蛋面', '桂圆莲子汤', '排骨烧千张结', '小白菜炒香菇', '苹果', '腐竹烧茄子', '六安酱鸭', '西兰花黑木耳炒蛋', '西红柿炒鸡蛋', '干煸花菜', '山药汤', '木耳炒白菜', '胡萝卜糖', '凉拌手撕茄子', '青椒豆腐丝', '西红柿烧豆腐', '土豆排骨汤', '芦笋腐竹炒木耳', '双菇竹荪汤', '冻豆腐炖白菜', '西红柿肉末烧豆腐', '干锅有机花菜', '白菜猪肉炖粉条', '肉末蒸茄子', '辣白菜锅', '凉拌空心菜', '香芹豆皮炒肉丝', '洋葱肉片烧茄子', '酸菜粉丝汤', '木耳鲜鱿', '虾仁肉末豆腐', '小白菜丸子汤', '凉拌粉丝菠菜', '鸡蛋粉丝拌菠菜', '清炒有机花菜', '番茄鸡球', '紫菜蛋饺汤', '香煎鸭脯肉', '紫菜豆腐汤', '排骨炖土豆', '肉包子', '黄瓜木耳炒鸡蛋', '西兰花炒番茄', '五花肉烧冻豆腐', '汆牛肉丸子', '麻油凉拌菠菜', '醋溜白菜', '青豆炒肉丁', '豆腐饼', '木耳腐竹拌芹菜', '丝瓜粉丝汤', '胡萝卜炒鸡蛋', '红烧排骨面', '蟹味菇炒肉丝', '百合炒菠菜', '花卷', '土豆炖牛肉', '洋葱青椒炒牛肉', '鸡蛋蒸豆腐', '白菜炖豆腐', '白菜心拌干丝', '水煮牛肉', '冰糖银耳汤', '蒜薹炒肉', '菠菜汆丸子', '凉拌海带丝', '尖椒炒肉丝', '菠菜鸡蛋饼', '牛肉汤面', '番茄炒蛋', '木耳炒蛋', '玉米青红椒炒肉丁', '彩椒牛肉',
          '胡萝卜韭黄炒肉丝', '拌牛肉丝', '番茄豆腐汤', '冬瓜蛋花汤', '凉拌小白菜', '西兰花拌胡萝卜', '西兰花炒廋肉', '清淡丝瓜汤', '黑木耳炒鸡蛋', '凉拌皮蛋豆腐', '蚝油烧豆腐', '海带排骨汤', '莴苣炒黑木耳', '蘑菇炖排骨', '手撕包菜',
         '萝卜排骨汤', '清炒青菜', '西兰花炒胡萝卜', '宫保豆腐', '番茄萝卜炖牛肉', '青椒炒肉', '木耳豆腐', '豆芽炒肉丝', '小炒牛肉', '番茄蔬菜汤', '冬笋鸡丝汤面', '洋葱炒肉丝', '馒头', '香菇土豆炒肉丝', '木耳拌海蜇', '豆腐酿肉', '土豆炒肉丝', '梅干菜炒牛肉', '番茄炒西兰花', '芋头红烧肉', '日本豆腐', '青椒茄子', '瘦肉山药炒木耳', '鸡蛋炒木耳', '手撕凉拌茄子', '皮蛋冬瓜汤', '白菜豆腐汤', '盐水白鸭', '丝瓜蒸豆腐', '清炒藕片', '青椒洋葱炒牛肉', '洋葱番茄汤', '火腿蔬菜粥', '香干回锅肉', '胡萝卜青椒鸡蛋饼', '鳕鱼排', '丝瓜炒鸡蛋', '木耳胡萝卜炒荷兰豆', '牛肉丝炒胡萝卜', '番茄鸡蛋疙瘩汤', '香菇西兰花', '西芹花生凉拌黑木耳', '青椒木耳炒鸡肉', '榨菜肉丝', '花菜炒肉', '豆腐烧青菜', '木耳黄瓜炒鸡蛋', '炒南瓜', '干锅千叶豆腐', '黄豆芽炒肉丝', '口蘑蛋花汤', '番茄蛋花汤', '香葱烧豆腐', '空心菜炒腊肉', '干煸牛肉丝', '麻酱生菜', '干煸有机花菜', '鲅鱼炖豆腐', '青菜瘦肉粥', '干贝冬瓜汤', '豌豆玉米胡萝卜肉丁', '番茄炒豆腐', '奶油小西点', '醋溜土豆丝', '番茄疙瘩汤', '木耳菜蛋花汤', '蔬菜猪肉云吞', '豆腐炒菠菜', '菠菜蛋汤', '冬笋炒肉片', '黄花菜炒肉丝', '四季豆炒肉丝', '红烧鲫鱼', '田园排骨汤', '胡萝卜丝饼', '清炒黑木耳', '紫菜虾皮豆腐汤', '排骨番茄焖土豆', '冬瓜肉片汤', '番茄鸡肉粒', '清蒸鲈鱼', '胡萝卜煲排骨', '蒜香排骨', '黄鱼炖豆腐', '西兰花青椒牛肉', '木耳酿肉', '山药煲排骨', '芹菜炒豆腐干', '凉拌木耳金针菇', '酱茄子', '香煎馒头片', '爆炒牛肉', '雪梨蒸冰糖', '粉蒸排骨', '笋片炒肉', '有机花菜', '水煮西兰花', '玉米胡萝卜排骨汤', '酱汁排骨', '土豆蒸排骨', '干豆角红烧肉', '糙米饭', '排骨焖饭', '胡萝卜炖排骨', '红烧茄子', '蚝油香菇豆腐', '青菜肉丝面', '土豆焖排骨', 'Fair Price 白馒头', '清蒸龙利鱼柳', '清炒豆腐', '冬笋炒牛肉', '栗子焖排骨', '蘑菇鸡蛋羹', '西芹炒胡萝卜', '排骨面', '腐竹烧肉', '拔丝山药', '圆白菜炒粉条', '白菜粉丝煲', '黑木耳腐竹炒鸡蛋', '内酯豆腐花蛤汤', '冬笋肉汤', '山药肉片', '芹菜炒肉丝', '山药小米粥', '肉末冬瓜', '西兰花炒肉片', '冬笋鸡汤', '蒜薹炒鸡蛋', '酱烧排骨', '胡萝卜炒木耳', '麻酱拌菠菜', '红薯鸡蛋羹', '黑木耳炒蛋', '番茄蘑菇蔬菜汤', '茄子干煸四季豆', '黑椒牛排骨', '蛋黄豆腐', '煎酿豆腐', '西芹木耳炒肉', '木耳炒豆芽', '鲜肉烧卖', '清蒸草鱼', '耗油生菜', '金针菇菠菜', '可乐鸭腿', '豆腐海带汤', '糖醋里脊', '梅干菜扣肉', '娃娃菜炒木耳', '西红柿炖豆腐', '海鲜汤', '番茄鱼片汤', '红烧鱼块', '蔬菜虾滑汤', '虾米菠菜鸡蛋汤', '香煎鲫鱼', '冻豆腐炖排骨', '珍珠丸子', '红烧鸡翅', '香煎豆腐', '西兰花肉片', '肉片烧菜花', '山椒牛肉丝', '豆腐干拌海带丝', '拌豆腐丝', '开洋萝卜丝汤', '土豆萝卜莲藕烧排骨', '虾仁烩豆腐', '清炒黄瓜', '紫菜蛋花汤', '小白菜烧芋头', '豆腐狮子头', '云吞', '莼菜香菇冬笋汤', '胡罗卜炒西兰花', '肉炒蒜苔', '鱼香茄子煲', '清炒上海青', '西芹炒肉', '菠菜鸡蛋拌粉丝', '海鲜时蔬汤', '番茄胡萝卜炖牛腩', '山药清汤', '口蘑牛肉汤面', '番茄青菜面', '豆腐鸡蛋', '银鱼炒鸡蛋', '猪肉白菜锅贴', '蘑菇洋葱炒肉', '排骨山药汤', '冬瓜羊肉汤', '银耳枸杞汤', '蒜苔木耳炒鸡蛋', '胡萝卜土豆炖牛肉', '绿豆汤', '山药炒木耳', '南乳排骨', '番茄烩豆腐', '洋葱拌木耳', '香酥鸭', '排骨烧粉条', '玉米莲藕排骨汤', '黑米粥', '小白菜汆丸子', '凉拌白菜丝', '萝卜丝肉丸汤', '木耳豆腐汤', '蘑菇炒肉', '滑炒鸡丝青椒', '三鲜豆腐', '溜白菜', '金针菇氽鱼片汤', '家常红烧糖醋排骨', '洋白菜炒木耳', '黄瓜炒鸡蛋', '胡萝卜烧牛腩', '香菇肉末烤茄子', '排骨海带汤', '圆白菜素炒饼', '菠菜煎饼', '彩椒西兰花', '杏鲍香菇汤', '香菇炒肉丁', '排骨炖时蔬', '酱香豆腐干', '木耳炒杂蔬', '清炖牛肉汤', '滑蛋虾仁', '大白菜鱼片汤', '口蘑炒肉', '蒜苔炒鸡蛋', '滑蛋豆腐', '白菜丸子汤', '木耳香菇肉片', '莲藕玉米排骨汤', '鲫鱼豆腐汤', '双菇烧豆腐', '猪骨红萝卜汤', '板粟蒸排骨', '山药羊肉汤', '白米饭', '豉油西兰花', '菠菜炒粉丝', '西兰花炒鸡蛋', '麻酱菠菜', '胡罗卜炒肉片', '口蘑油豆腐']

    return  names

def ImageTransform():
    """
    to get a image trainform of dataloader
    return: transform
    """
    transform = transforms.Compose([
        transforms.Resize(size=256),
        transforms.RandomCrop(size=224),
        transforms.ToTensor(),
        transforms.Normalize([0.485, 0.456, 0.406],
                            [0.229, 0.224, 0.225])
    ])
    return transform

def InitModel():
    """
    initiate pretrained model
    and put into cuda device
    """
    # model_path = "food_resnest_18.pt"
    
    NUM_CLASS = 1340
    model_path = "food_resnest_final14.pt"
    model = timm.create_model('resnest101e', pretrained=False,num_classes=NUM_CLASS)
    # model_path = "food30.pt"
    # model = timm.create_model('efficientnet_b3', pretrained=False,num_classes=NUM_CLASS)
    model.load_state_dict(torch.load(model_path))
    model.cuda()
    model.eval()
    # return model

    model_path = "simple_resnest_24.pt"
    model1 = timm.create_model('resnest101e', pretrained=False,num_classes=NUM_CLASS)
    # model_path = "food30.pt"
    # model = timm.create_model('efficientnet_b3', pretrained=False,num_classes=NUM_CLASS)
    model1.load_state_dict(torch.load(model_path))
    model1.cuda()
    model1.eval()
    return [model,model1]

def ImageToTensor(image,transform):
    """
    input: PIL.Image
    output: 4_dim tensor
    """
    tensor=transform(image) # 3_dim
    t = tensor.unsqueeze(0) # 4_dim
    return t

def GetImageTensorForInput(image,transform):
    """
    form a image file  to get a fitable input tensor
    """
    t = ImageToTensor(image,transform)
    return t

def GetInferenceResult(model,input,labels):
    """
    input: model tensor of image
    output: dict[label_name,probability] of top 3, SORTED form Big->Small
    """
    [model0,model1]=model
    input = input.cuda()
    output0 = model0(input)
    output1 = model1(input)
    output = output0+output1
    # output=model(input)
    softmax = torch.nn.Softmax(dim=1)
    output = softmax(output)
    maxk = max((1,3))
    ret,predictions = output.topk(maxk,1,True,True)
    #   dim_1 of tensor to list
    ret = ret.squeeze(0).detach().cpu().numpy().tolist()
    predictions = predictions.squeeze(0).detach().cpu().numpy().tolist()

    result=[]
    for probability,class_num in zip(ret,predictions):
        result.append([labels[class_num],probability])
        # result.append([labels[class_num],probability])
    result.sort(key=lambda x:x[1],reverse=True)
    return result

def SpeedTest(model,test_nums):
    """
    model is loaded in CUDA memory, test time should be very short
    ~ 0.026s/img 
    """
    image_path = "7.jpg"
    image=Image.open(image_path).convert("RGB")
    labels = GetClassNames(mode="hardcode") 
    tic_0 = time.time()
    for i in range(test_nums):
        tensor = GetImageTensorForInput(image=image,transform=transform)
        result = GetInferenceResult(model,tensor,labels)
    tic_1 = time.time()
    print("test for {} times, avarage time is {}".format(test_nums,(tic_1-tic_0)/test_nums))

app = Flask(__name__)
app.send_file_max_age_default = timedelta(seconds=1)
app.config["JSON_AS_ASCII"]=False # ensure send utf-8 characters
@app.route("/upload",methods=['POST'])
def upload():
    try:
        image=request.files['image']
        if not image.mimetype.__contains__('image'):
            return '上传的文件不是图片'
    except:
        return '请上传需要预测的图片'
    img=Image.open(image).convert('RGB')
    tensor = GetImageTensorForInput(image=img,transform=transform)
    result = GetInferenceResult(model,tensor,labels)
    print(request.remote_addr)
    recordRequest(request)
    # print(result)
    return jsonify({'result': result})
    #return result

def recordRequest(request):
    now_time = datetime.datetime.now()
    text = "{}\n{}\n".format(now_time,request.remote_addr)
    with open("REQUEST_LOG.LOG",'a') as f:
        f.write(text);
    




if __name__=='__main__':
    # Load transform , model , label names 
    transform = ImageTransform()
    model = InitModel()
    labels = GetClassNames(mode="hardcode") 
    

    # This should be always in memory, and wait for request for inference .

    #TODO API for listen to network request?
    app.run(host="0.0.0.0",port=53031)
    # app.run(host="121.5.57.114",port=8090)

    # A image inference test
    # image_path = "images/7.jpg"
    # image=Image.open(image_path).convert("RGB")
    # tensor = GetImageTensorForInput(image=image,transform=transform)
    # result = GetInferenceResult(model,tensor,labels)
    # print(result)

    # # Speed Test
    # SpeedTest(model,10)
   


